In [1]:
import pandas as pd

In [8]:
friends =  [{'name': 'Jone', 'age': 15, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': None},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friends)
df = df[['name', 'age', 'job']]

In [9]:
df.head()

    name  age      job
0   Jone   15  student
1  Jenny   30     None
2   Nate   30  teacher

df.to_csv 기본값 지정 : index = True, header = True  
* na_rep = '-' 빈값 변경하기
df.to_csv('friends.csv')  => df.to_csv('friends.csv', index = True, header = True)

In [6]:
df.to_csv('friends.csv')

In [10]:
df.to_csv('friends2.csv', index = False, header = False, na_rep = '-')

In [11]:
friend_list = [ 
                ['name',['John', 'Jenny', 'Nate']],
                ['age',[20,30,30]],
                ['job',['student', 'developer', 'teacher']] 
              ]
df = pd.DataFrame.from_items(friend_list)

In [12]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [13]:
df [1:3]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [17]:
df [0:]

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [18]:
df.loc[[0,2]]

   name  age      job
0  John   20  student
2  Nate   30  teacher

### by column condition

In [20]:
df[df.age > 25]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [21]:
df.query('age>25')

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [23]:
df[(df.age > 25) & (df.name == 'Nate')]

   name  age      job
2  Nate   30  teacher

In [39]:
df.iloc[:, 0:2]

       0   1
0   Jone  15
1  Jenny  30
2   Nate  30

## FIlter Column

### by index

In [34]:
friend_list =  [
         ['Jone', 15, 'student'],
         ['Jenny', 30,  'developer'],
         ['Nate', 30, 'teacher']
]
df = pd.DataFrame.from_records(friend_list)

In [35]:
df

       0   1          2
0   Jone  15    student
1  Jenny  30  developer
2   Nate  30    teacher

In [38]:
df.iloc[: , 0:2]

       0   1
0   Jone  15
1  Jenny  30
2   Nate  30

In [37]:
df.iloc[0:2, 0:2]

       0   1
0   Jone  15
1  Jenny  30

### by column name

In [41]:
df = pd.read_csv("../input/friend_list_no_head.csv", header = None, names={'name', 'age', 'job'})

In [42]:
df

     age  job       name
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [43]:
df_filtered = df[['name', 'age']]

In [44]:
df_filtered

        name    age
0    student   John
1  developer  Jenny
2    teacher   Nate
3    dentist  Julia
4    manager  Brian
5     intern  Chris

In [45]:
df.filter(items=['age', 'job'])

     age  job
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [47]:
# column name like 'a'
df.filter(like='a' , axis=1)

     age       name
0   John    student
1  Jenny  developer
2   Nate    teacher
3  Julia    dentist
4  Brian    manager
5  Chris     intern

In [48]:
# 정규식 'b' 끝나는 컬럼명 필터
df.filter(regex='b$', axis=1)

   job
0   20
1   30
2   30
3   40
4   45
5   25